ftrias/vindormusic/firmware/dfu/bootloader/mk20dx128-old.h
// Chapter 12: System Integration Module (SIM)
#define SIM_SOPT1               *(volatile uint32_t *)0x40047000 // System Options Register 1
#define SIM_SOPT1CFG            *(volatile uint32_t *)0x40047004 // SOPT1 Configuration Register
#define SIM_SOPT2               *(volatile uint32_t *)0x40048004 // System Options Register 2
#define SIM_SOPT2_USBSRC        (uint32_t)0x00040000        // 0=USB_CLKIN, 1=FFL/PLL 
#define SIM_SOPT2_PLLFLLSEL     (uint32_t)0x00010000        // 0=FLL, 1=PLL
#define SIM_SOPT2_TRACECLKSEL       (uint32_t)0x00001000        // 0=MCGOUTCLK, 1=CPU
#define SIM_SOPT2_PTD7PAD       (uint32_t)0x00000800        // 0=normal, 1=double drive PTD7
#define SIM_SOPT2_CLKOUTSEL(n)      (uint32_t)(((n) & 7) << 5)  // Selects the clock to output on the CLKOUT pin.
#define SIM_SOPT2_RTCCLKOUTSEL      (uint32_t)0x00000010        // RTC clock out select
#define SIM_SOPT4               *(volatile uint32_t *)0x4004800C // System Options Register 4
#define SIM_SOPT5               *(volatile uint32_t *)0x40048010 // System Options Register 5
#define SIM_SOPT7               *(volatile uint32_t *)0x40048018 // System Options Register 7
#define SIM_SDID                *(const    uint32_t *)0x40048024 // System Device Identification Register
#define SIM_SCGC3               (*(volatile uint32_t *)0x40048030) // System Clock Gating Control Register 3
#define SIM_SCGC3_ADC1                  ((uint32_t)0x08000000)          // ADC1 Clock Gate Control
#define SIM_SCGC3_FTM2                  ((uint32_t)0x01000000)          // FTM2 Clock Gate Control
#define SIM_SCGC4               *(volatile uint32_t *)0x40048034 // System Clock Gating Control Register 4
#define SIM_SCGC4_VREF          (uint32_t)0x00100000        // VREF Clock Gate Control
#define SIM_SCGC4_CMP           (uint32_t)0x00080000        // Comparator Clock Gate Control
#define SIM_SCGC4_USBOTG        (uint32_t)0x00040000        // USB Clock Gate Control
#define SIM_SCGC4_UART2         (uint32_t)0x00001000        // UART2 Clock Gate Control
#define SIM_SCGC4_UART1         (uint32_t)0x00000800        // UART1 Clock Gate Control
#define SIM_SCGC4_UART0         (uint32_t)0x00000400        // UART0 Clock Gate Control
#define SIM_SCGC4_I2C0          (uint32_t)0x00000040        // I2C0 Clock Gate Control
#define SIM_SCGC4_CMT           (uint32_t)0x00000004        // CMT Clock Gate Control
#define SIM_SCGC4_EWM           (uint32_t)0x00000002        // EWM Clock Gate Control
#define SIM_SCGC5               *(volatile uint32_t *)0x40048038 // System Clock Gating Control Register 5
#define SIM_SCGC5_PORTE         (uint32_t)0x00002000        // Port E Clock Gate Control
#define SIM_SCGC5_PORTD         (uint32_t)0x00001000        // Port D Clock Gate Control
#define SIM_SCGC5_PORTC         (uint32_t)0x00000800        // Port C Clock Gate Control
#define SIM_SCGC5_PORTB         (uint32_t)0x00000400        // Port B Clock Gate Control
#define SIM_SCGC5_PORTA         (uint32_t)0x00000200        // Port A Clock Gate Control
#define SIM_SCGC5_TSI           (uint32_t)0x00000020        // Touch Sense Input TSI Clock Gate Control
#define SIM_SCGC5_LPTIMER       (uint32_t)0x00000001        // Low Power Timer Access Control
#define SIM_SCGC6               *(volatile uint32_t *)0x4004803C // System Clock Gating Control Register 6
#define SIM_SCGC6_RTC           (uint32_t)0x20000000        // RTC Access
#define SIM_SCGC6_ADC0          (uint32_t)0x08000000        // ADC0 Clock Gate Control
#define SIM_SCGC6_FTM1          (uint32_t)0x02000000        // FTM1 Clock Gate Control
#define SIM_SCGC6_FTM0          (uint32_t)0x01000000        // FTM0 Clock Gate Control
#define SIM_SCGC6_PIT           (uint32_t)0x00800000        // PIT Clock Gate Control
#define SIM_SCGC6_PDB           (uint32_t)0x00400000        // PDB Clock Gate Control
#define SIM_SCGC6_USBDCD        (uint32_t)0x00200000        // USB DCD Clock Gate Control
#define SIM_SCGC6_CRC           (uint32_t)0x00040000        // CRC Clock Gate Control
#define SIM_SCGC6_I2S           (uint32_t)0x00008000        // I2S Clock Gate Control
#define SIM_SCGC6_SPI0          (uint32_t)0x00001000        // SPI0 Clock Gate Control
#define SIM_SCGC6_DMAMUX        (uint32_t)0x00000002        // DMA Mux Clock Gate Control
#define SIM_SCGC6_FTFL          (uint32_t)0x00000001        // Flash Memory Clock Gate Control
#define SIM_SCGC7               *(volatile uint32_t *)0x40048040 // System Clock Gating Control Register 7
#define SIM_SCGC7_DMA           (uint32_t)0x00000020        // DMA Clock Gate Control
#define SIM_CLKDIV1             *(volatile uint32_t *)0x40048044 // System Clock Divider Register 1
#define SIM_CLKDIV1_OUTDIV1(n)      (uint32_t)(((n) & 0x0F) << 28)  // divide value for the core/system clock
#define SIM_CLKDIV1_OUTDIV2(n)      (uint32_t)(((n) & 0x0F) << 24)  // divide value for the peripheral clock
#define SIM_CLKDIV1_OUTDIV4(n)      (uint32_t)(((n) & 0x0F) << 16)  // divide value for the flash clock
#define SIM_CLKDIV2             *(volatile uint32_t *)0x40048048 // System Clock Divider Register 2
#define SIM_CLKDIV2_USBDIV(n)       (uint32_t)(((n) & 0x07) << 1)
#define SIM_CLKDIV2_USBFRAC     (uint32_t)0x01
#define SIM_FCFG1               *(const    uint32_t *)0x4004804C // Flash Configuration Register 1
#define SIM_FCFG2               *(const    uint32_t *)0x40048050 // Flash Configuration Register 2
#define SIM_UIDH                *(const    uint32_t *)0x40048054 // Unique Identification Register High
#define SIM_UIDMH               *(const    uint32_t *)0x40048058 // Unique Identification Register Mid-High
#define SIM_UIDML               *(const    uint32_t *)0x4004805C // Unique Identification Register Mid Low
#define SIM_UIDL                *(const    uint32_t *)0x40048060 // Unique Identification Register Low

// Chapter 13: Reset Control Module (RCM)
#define RCM_SRS0                *(volatile uint8_t  *)0x4007F000 // System Reset Status Register 0
#define RCM_SRS1                *(volatile uint8_t  *)0x4007F001 // System Reset Status Register 1
#define RCM_RPFC                *(volatile uint8_t  *)0x4007F004 // Reset Pin Filter Control Register
#define RCM_RPFW                *(volatile uint8_t  *)0x4007F005 // Reset Pin Filter Width Register
#define RCM_MR                  *(volatile uint8_t  *)0x4007F007 // Mode Register

// Chapter 14: System Mode Controller
#define SMC_PMPROT              *(volatile uint8_t  *)0x4007E000 // Power Mode Protection Register
#define SMC_PMPROT_AVLP         (uint8_t)0x20           // Allow very low power modes
#define SMC_PMPROT_ALLS         (uint8_t)0x08           // Allow low leakage stop mode
#define SMC_PMPROT_AVLLS        (uint8_t)0x02           // Allow very low leakage stop mode
#define SMC_PMCTRL              *(volatile uint8_t  *)0x4007E001 // Power Mode Control Register
#define SMC_PMCTRL_LPWUI        (uint8_t)0x80           // Low Power Wake Up on Interrupt
#define SMC_PMCTRL_RUNM(n)      (uint8_t)(((n) & 0x03) << 5)    // Run Mode Control
#define SMC_PMCTRL_STOPA        (uint8_t)0x08           // Stop Aborted
#define SMC_PMCTRL_STOPM(n)     (uint8_t)((n) & 0x07)       // Stop Mode Control
#define SMC_VLLSCTRL            *(volatile uint8_t  *)0x4007E002 // VLLS Control Register
#define SMC_VLLSCTRL_PORPO      (uint8_t)0x20           // POR Power Option
#define SMC_VLLSCTRL_VLLSM(n)       (uint8_t)((n) & 0x07)       // VLLS Mode Control
#define SMC_PMSTAT              *(volatile uint8_t  *)0x4007E003 // Power Mode Status Register
#define SMC_PMSTAT_RUN          (uint8_t)0x01           // Current power mode is RUN
#define SMC_PMSTAT_STOP         (uint8_t)0x02           // Current power mode is STOP
#define SMC_PMSTAT_VLPR         (uint8_t)0x04           // Current power mode is VLPR
#define SMC_PMSTAT_VLPW         (uint8_t)0x08           // Current power mode is VLPW
#define SMC_PMSTAT_VLPS         (uint8_t)0x10           // Current power mode is VLPS
#define SMC_PMSTAT_LLS          (uint8_t)0x20           // Current power mode is LLS
#define SMC_PMSTAT_VLLS         (uint8_t)0x40           // Current power mode is VLLS

// Chapter 15: Power Management Controller
#define PMC_LVDSC1              *(volatile uint8_t  *)0x4007D000 // Low Voltage Detect Status And Control 1 register
#define PMC_LVDSC1_LVDF         (uint8_t)0x80           // Low-Voltage Detect Flag
#define PMC_LVDSC1_LVDACK       (uint8_t)0x40           // Low-Voltage Detect Acknowledge
#define PMC_LVDSC1_LVDIE        (uint8_t)0x20           // Low-Voltage Detect Interrupt Enable
#define PMC_LVDSC1_LVDRE        (uint8_t)0x10           // Low-Voltage Detect Reset Enable
#define PMC_LVDSC1_LVDV(n)      (uint8_t)((n) & 0x03)       // Low-Voltage Detect Voltage Select
#define PMC_LVDSC2              *(volatile uint8_t  *)0x4007D001 // Low Voltage Detect Status And Control 2 register
#define PMC_LVDSC2_LVWF         (uint8_t)0x80           // Low-Voltage Warning Flag
#define PMC_LVDSC2_LVWACK       (uint8_t)0x40           // Low-Voltage Warning Acknowledge
#define PMC_LVDSC2_LVWIE        (uint8_t)0x20           // Low-Voltage Warning Interrupt Enable
#define PMC_LVDSC2_LVWV(n)      (uint8_t)((n) & 0x03)       // Low-Voltage Warning Voltage Select
#define PMC_REGSC               *(volatile uint8_t  *)0x4007D002 // Regulator Status And Control register
#define PMC_REGSC_BGEN          (uint8_t)0x10           // Bandgap Enable In VLPx Operation
#define PMC_REGSC_ACKISO        (uint8_t)0x08           // Acknowledge Isolation
#define PMC_REGSC_REGONS        (uint8_t)0x04           // Regulator In Run Regulation Status
#define PMC_REGSC_BGBE          (uint8_t)0x01           // Bandgap Buffer Enable

// Chapter 16: Low-Leakage Wakeup Unit (LLWU)
#define LLWU_PE1                *(volatile uint8_t  *)0x4007C000 // LLWU Pin Enable 1 register
#define LLWU_PE2                *(volatile uint8_t  *)0x4007C001 // LLWU Pin Enable 2 register
#define LLWU_PE3                *(volatile uint8_t  *)0x4007C002 // LLWU Pin Enable 3 register
#define LLWU_PE4                *(volatile uint8_t  *)0x4007C003 // LLWU Pin Enable 4 register
#define LLWU_ME                 *(volatile uint8_t  *)0x4007C004 // LLWU Module Enable register
#define LLWU_F1                 *(volatile uint8_t  *)0x4007C005 // LLWU Flag 1 register
#define LLWU_F2                 *(volatile uint8_t  *)0x4007C006 // LLWU Flag 2 register
#define LLWU_F3                 *(volatile uint8_t  *)0x4007C007 // LLWU Flag 3 register
#define LLWU_FILT1              *(volatile uint8_t  *)0x4007C008 // LLWU Pin Filter 1 register
#define LLWU_FILT2              *(volatile uint8_t  *)0x4007C009 // LLWU Pin Filter 2 register
#define LLWU_RST                *(volatile uint8_t  *)0x4007C00A // LLWU Reset Enable register

// Chapter 17: Miscellaneous Control Module (MCM)
#define MCM_PLASC               *(volatile uint16_t *)0xE0080008 // Crossbar Switch (AXBS) Slave Configuration
#define MCM_PLAMC               *(volatile uint16_t *)0xE008000A // Crossbar Switch (AXBS) Master Configuration
#define MCM_PLACR               *(volatile uint32_t *)0xE008000C // Crossbar Switch (AXBS) Control Register

// Chapter 20: Direct Memory Access Multiplexer (DMAMUX)
#define DMAMUX0_CHCFG0          *(volatile uint8_t  *)0x40021000 // Channel Configuration register
#define DMAMUX0_CHCFG1          *(volatile uint8_t  *)0x40021001 // Channel Configuration register
#define DMAMUX0_CHCFG2          *(volatile uint8_t  *)0x40021002 // Channel Configuration register
#define DMAMUX0_CHCFG3          *(volatile uint8_t  *)0x40021003 // Channel Configuration register
#define DMAMUX0_CHCFG4          *(volatile uint8_t  *)0x40021004 // Channel Configuration register
#define DMAMUX0_CHCFG5          *(volatile uint8_t  *)0x40021005 // Channel Configuration register
#define DMAMUX0_CHCFG6          *(volatile uint8_t  *)0x40021006 // Channel Configuration register
#define DMAMUX0_CHCFG7          *(volatile uint8_t  *)0x40021007 // Channel Configuration register
#define DMAMUX0_CHCFG8          *(volatile uint8_t  *)0x40021008 // Channel Configuration register
#define DMAMUX0_CHCFG9          *(volatile uint8_t  *)0x40021009 // Channel Configuration register
#define DMAMUX0_CHCFG10         *(volatile uint8_t  *)0x4002100A // Channel Configuration register
#define DMAMUX0_CHCFG11         *(volatile uint8_t  *)0x4002100B // Channel Configuration register
#define DMAMUX0_CHCFG12         *(volatile uint8_t  *)0x4002100C // Channel Configuration register
#define DMAMUX0_CHCFG13         *(volatile uint8_t  *)0x4002100D // Channel Configuration register
#define DMAMUX0_CHCFG14         *(volatile uint8_t  *)0x4002100E // Channel Configuration register
#define DMAMUX0_CHCFG15         *(volatile uint8_t  *)0x4002100F // Channel Configuration register
#define DMAMUX_DISABLE          0
#define DMAMUX_TRIG         64
#define DMAMUX_ENABLE           128
#define DMAMUX_SOURCE_UART0_RX      2
#define DMAMUX_SOURCE_UART0_TX      3
#define DMAMUX_SOURCE_UART1_RX      4
#define DMAMUX_SOURCE_UART1_TX      5
#define DMAMUX_SOURCE_UART2_RX      6
#define DMAMUX_SOURCE_UART2_TX      7
#define DMAMUX_SOURCE_I2S0_RX       14
#define DMAMUX_SOURCE_I2S0_TX       15
#define DMAMUX_SOURCE_SPI0_RX       16
#define DMAMUX_SOURCE_SPI0_TX       17
#define DMAMUX_SOURCE_I2C0      22
#define DMAMUX_SOURCE_FTM0_CH0      24
#define DMAMUX_SOURCE_FTM0_CH1      25
#define DMAMUX_SOURCE_FTM0_CH2      26
#define DMAMUX_SOURCE_FTM0_CH3      27
#define DMAMUX_SOURCE_FTM0_CH4      28
#define DMAMUX_SOURCE_FTM0_CH5      29
#define DMAMUX_SOURCE_FTM0_CH6      30
#define DMAMUX_SOURCE_FTM0_CH7      31
#define DMAMUX_SOURCE_FTM1_CH0      32
#define DMAMUX_SOURCE_FTM1_CH1      33
#define DMAMUX_SOURCE_ADC0      40
#define DMAMUX_SOURCE_CMP0      42
#define DMAMUX_SOURCE_CMP1      43
#define DMAMUX_SOURCE_CMT       47
#define DMAMUX_SOURCE_PDB       48
#define DMAMUX_SOURCE_PORTA     49
#define DMAMUX_SOURCE_PORTB     50
#define DMAMUX_SOURCE_PORTC     51
#define DMAMUX_SOURCE_PORTD     52
#define DMAMUX_SOURCE_PORTE     53
#define DMAMUX_SOURCE_ALWAYS0       54
#define DMAMUX_SOURCE_ALWAYS1       55
#define DMAMUX_SOURCE_ALWAYS2       56
#define DMAMUX_SOURCE_ALWAYS3       57
#define DMAMUX_SOURCE_ALWAYS4       58
#define DMAMUX_SOURCE_ALWAYS5       59
#define DMAMUX_SOURCE_ALWAYS6       60
#define DMAMUX_SOURCE_ALWAYS7       61
#define DMAMUX_SOURCE_ALWAYS8       62
#define DMAMUX_SOURCE_ALWAYS9       63

// Chapter 21: Direct Memory Access Controller (eDMA)
#define DMA_CR                  *(volatile uint32_t *)0x40008000 // Control Register
#define DMA_ES                  *(volatile uint32_t *)0x40008004 // Error Status Register
#define DMA_ERQ                 *(volatile uint32_t *)0x4000800C // Enable Request Register
#define DMA_EEI                 *(volatile uint32_t *)0x40008014 // Enable Error Interrupt Register
#define DMA_CEEI                *(volatile uint8_t  *)0x40008018 // Clear Enable Error Interrupt Register
#define DMA_SEEI                *(volatile uint8_t  *)0x40008019 // Set Enable Error Interrupt Register
#define DMA_CERQ                *(volatile uint8_t  *)0x4000801A // Clear Enable Request Register
#define DMA_SERQ                *(volatile uint8_t  *)0x4000801B // Set Enable Request Register
#define DMA_CDNE                *(volatile uint8_t  *)0x4000801C // Clear DONE Status Bit Register
#define DMA_SSRT                *(volatile uint8_t  *)0x4000801D // Set START Bit Register
#define DMA_CERR                *(volatile uint8_t  *)0x4000801E // Clear Error Register
#define DMA_CINT                *(volatile uint8_t  *)0x4000801F // Clear Interrupt Request Register
#define DMA_INT                 *(volatile uint32_t *)0x40008024 // Interrupt Request Register
#define DMA_ERR                 *(volatile uint32_t *)0x4000802C // Error Register
#define DMA_HRS                 *(volatile uint32_t *)0x40008034 // Hardware Request Status Register
#define DMA_DCHPRI3             *(volatile uint8_t  *)0x40008100 // Channel n Priority Register
#define DMA_DCHPRI2             *(volatile uint8_t  *)0x40008101 // Channel n Priority Register
#define DMA_DCHPRI1             *(volatile uint8_t  *)0x40008102 // Channel n Priority Register
#define DMA_DCHPRI0             *(volatile uint8_t  *)0x40008103 // Channel n Priority Register

