ftrias/vindormusic/firmware/dfu/bootloader/mk20dx128-old.h
// Chapter 22: External Watchdog Monitor (EWM)
#define EWM_CTRL                *(volatile uint8_t  *)0x40061000 // Control Register
#define EWM_SERV                *(volatile uint8_t  *)0x40061001 // Service Register
#define EWM_CMPL                *(volatile uint8_t  *)0x40061002 // Compare Low Register
#define EWM_CMPH                *(volatile uint8_t  *)0x40061003 // Compare High Register

// Chapter 23: Watchdog Timer (WDOG)
#define WDOG_STCTRLH            *(volatile uint16_t *)0x40052000 // Watchdog Status and Control Register High
#define WDOG_STCTRLH_DISTESTWDOG    (uint16_t)0x4000        // Allows the WDOG's functional test mode to be disabled permanently.
#define WDOG_STCTRLH_BYTESEL(n)     (uint16_t)(((n) & 3) << 12) // selects the byte to be tested when the watchdog is in the byte test mode.
#define WDOG_STCTRLH_TESTSEL        (uint16_t)0x0800
#define WDOG_STCTRLH_TESTWDOG       (uint16_t)0x0400
#define WDOG_STCTRLH_WAITEN     (uint16_t)0x0080
#define WDOG_STCTRLH_STOPEN     (uint16_t)0x0040
#define WDOG_STCTRLH_DBGEN      (uint16_t)0x0020
#define WDOG_STCTRLH_ALLOWUPDATE    (uint16_t)0x0010
#define WDOG_STCTRLH_WINEN      (uint16_t)0x0008
#define WDOG_STCTRLH_IRQRSTEN       (uint16_t)0x0004
#define WDOG_STCTRLH_CLKSRC     (uint16_t)0x0002
#define WDOG_STCTRLH_WDOGEN     (uint16_t)0x0001
#define WDOG_STCTRLL            *(volatile uint16_t *)0x40052002 // Watchdog Status and Control Register Low
#define WDOG_TOVALH             *(volatile uint16_t *)0x40052004 // Watchdog Time-out Value Register High
#define WDOG_TOVALL             *(volatile uint16_t *)0x40052006 // Watchdog Time-out Value Register Low
#define WDOG_WINH               *(volatile uint16_t *)0x40052008 // Watchdog Window Register High
#define WDOG_WINL               *(volatile uint16_t *)0x4005200A // Watchdog Window Register Low
#define WDOG_REFRESH            *(volatile uint16_t *)0x4005200C // Watchdog Refresh register
#define WDOG_UNLOCK             *(volatile uint16_t *)0x4005200E // Watchdog Unlock register
#define WDOG_UNLOCK_SEQ1        (uint16_t)0xC520
#define WDOG_UNLOCK_SEQ2        (uint16_t)0xD928
#define WDOG_TMROUTH            *(volatile uint16_t *)0x40052010 // Watchdog Timer Output Register High
#define WDOG_TMROUTL            *(volatile uint16_t *)0x40052012 // Watchdog Timer Output Register Low
#define WDOG_RSTCNT             *(volatile uint16_t *)0x40052014 // Watchdog Reset Count register
#define WDOG_PRESC              *(volatile uint16_t *)0x40052016 // Watchdog Prescaler register

// Chapter 24: Multipurpose Clock Generator (MCG)
#define MCG_C1                  *(volatile uint8_t  *)0x40064000 // MCG Control 1 Register
#define MCG_C1_IREFSTEN         (uint8_t)0x01           // Internal Reference Stop Enable, Controls whether or not the internal reference clock remains enabled when the MCG enters Stop mode.
#define MCG_C1_IRCLKEN          (uint8_t)0x02           // Internal Reference Clock Enable, Enables the internal reference clock for use as MCGIRCLK.
#define MCG_C1_IREFS            (uint8_t)0x04           // Internal Reference Select, Selects the reference clock source for the FLL.
#define MCG_C1_FRDIV(n)         (uint8_t)(((n) & 0x07) << 3)    // FLL External Reference Divider, Selects the amount to divide down the external reference clock for the FLL
#define MCG_C1_CLKS(n)          (uint8_t)(((n) & 0x03) << 6)    // Clock Source Select, Selects the clock source for MCGOUTCLK
#define MCG_C2                  *(volatile uint8_t  *)0x40064001 // MCG Control 2 Register
#define MCG_C2_IRCS         (uint8_t)0x01           // Internal Reference Clock Select, Selects between the fast or slow internal reference clock source.
#define MCG_C2_LP           (uint8_t)0x02           // Low Power Select, Controls whether the FLL or PLL is disabled in BLPI and BLPE modes.
#define MCG_C2_EREFS            (uint8_t)0x04           // External Reference Select, Selects the source for the external reference clock. 
#define MCG_C2_HGO0         (uint8_t)0x08           // High Gain Oscillator Select, Controls the crystal oscillator mode of operation
#define MCG_C2_RANGE0(n)        (uint8_t)(((n) & 0x03) << 4)    // Frequency Range Select, Selects the frequency range for the crystal oscillator
#define MCG_C2_LOCRE0           (uint8_t)0x80           // Loss of Clock Reset Enable, Determines whether an interrupt or a reset request is made following a loss of OSC0 
#define MCG_C3                  *(volatile uint8_t  *)0x40064002 // MCG Control 3 Register
#define MCG_C3_SCTRIM(n)        (uint8_t)(n)            // Slow Internal Reference Clock Trim Setting
#define MCG_C4                  *(volatile uint8_t  *)0x40064003 // MCG Control 4 Register
#define MCG_C4_SCFTRIM          (uint8_t)0x01           // Slow Internal Reference Clock Fine Trim
#define MCG_C4_FCTRIM(n)        (uint8_t)(((n) & 0x0F) << 1)    // Fast Internal Reference Clock Trim Setting
#define MCG_C4_DRST_DRS(n)      (uint8_t)(((n) & 0x03) << 5)    // DCO Range Select
#define MCG_C4_DMX32            (uint8_t)0x80           // DCO Maximum Frequency with 32.768 kHz Reference, controls whether the DCO frequency range is narrowed
#define MCG_C5                  *(volatile uint8_t  *)0x40064004 // MCG Control 5 Register
#define MCG_C5_PRDIV0(n)        (uint8_t)((n) & 0x1F)       // PLL External Reference Divider
#define MCG_C5_PLLSTEN0         (uint8_t)0x20           // PLL Stop Enable
#define MCG_C5_PLLCLKEN0        (uint8_t)0x40           // PLL Clock Enable
#define MCG_C6                  *(volatile uint8_t  *)0x40064005 // MCG Control 6 Register
#define MCG_C6_VDIV0(n)         (uint8_t)((n) & 0x1F)       // VCO 0 Divider
#define MCG_C6_CME0         (uint8_t)0x20           // Clock Monitor Enable
#define MCG_C6_PLLS         (uint8_t)0x40           // PLL Select, Controls whether the PLL or FLL output is selected as the MCG source when CLKS[1:0]=00. 
#define MCG_C6_LOLIE0           (uint8_t)0x80           // Loss of Lock Interrrupt Enable
#define MCG_S                   *(volatile uint8_t  *)0x40064006 // MCG Status Register
#define MCG_S_IRCST         (uint8_t)0x01           // Internal Reference Clock Status
#define MCG_S_OSCINIT0          (uint8_t)0x02           // OSC Initialization,  resets to 0, is set to 1 after the initialization cycles of the crystal oscillator
#define MCG_S_CLKST(n)          (uint8_t)(((n) & 0x03) << 2)    // Clock Mode Status, 0=FLL is selected, 1= Internal ref, 2=External ref, 3=PLL
#define MCG_S_CLKST_MASK        (uint8_t)0x0C
#define MCG_S_IREFST            (uint8_t)0x10           // Internal Reference Status
#define MCG_S_PLLST         (uint8_t)0x20           // PLL Select Status
#define MCG_S_LOCK0         (uint8_t)0x40           // Lock Status, 0=PLL Unlocked, 1=PLL Locked
#define MCG_S_LOLS0         (uint8_t)0x80           // Loss of Lock Status
#define MCG_SC                  *(volatile uint8_t  *)0x40064008 // MCG Status and Control Register
#define MCG_SC_LOCS0            (uint8_t)0x01           // OSC0 Loss of Clock Status
#define MCG_SC_FCRDIV(n)        (uint8_t)(((n) & 0x07) << 1)    // Fast Clock Internal Reference Divider
#define MCG_SC_FLTPRSRV         (uint8_t)0x10           // FLL Filter Preserve Enable
#define MCG_SC_ATMF         (uint8_t)0x20           // Automatic Trim Machine Fail Flag
#define MCG_SC_ATMS         (uint8_t)0x40           // Automatic Trim Machine Select
#define MCG_SC_ATME         (uint8_t)0x80           // Automatic Trim Machine Enable
#define MCG_ATCVH               *(volatile uint8_t  *)0x4006400A // MCG Auto Trim Compare Value High Register
#define MCG_ATCVL               *(volatile uint8_t  *)0x4006400B // MCG Auto Trim Compare Value Low Register
#define MCG_C7                  *(volatile uint8_t  *)0x4006400C // MCG Control 7 Register
#define MCG_C8                  *(volatile uint8_t  *)0x4006400D // MCG Control 8 Register

// Chapter 25: Oscillator (OSC)
#define OSC0_CR                 *(volatile uint8_t  *)0x40065000 // OSC Control Register
#define OSC_SC16P           (uint8_t)0x01           // Oscillator 16 pF Capacitor Load Configure
#define OSC_SC8P            (uint8_t)0x02           // Oscillator 8 pF Capacitor Load Configure
#define OSC_SC4P            (uint8_t)0x04           // Oscillator 4 pF Capacitor Load Configure
#define OSC_SC2P            (uint8_t)0x08           // Oscillator 2 pF Capacitor Load Configure
#define OSC_EREFSTEN            (uint8_t)0x20           // External Reference Stop Enable, Controls whether or not the external reference clock (OSCERCLK) remains enabled when MCU enters Stop mode.
#define OSC_ERCLKEN         (uint8_t)0x80           // External Reference Enable, Enables external reference clock (OSCERCLK).

// Chapter 27: Flash Memory Controller (FMC)
#define FMC_PFAPR       *(volatile uint32_t *)0x4001F000    // Flash Access Protection
#define FMC_PFB0CR      *(volatile uint32_t *)0x4001F004    // Flash Control
#define FMC_TAGVDW0S0       *(volatile uint32_t *)0x4001F100    // Cache Tag Storage
#define FMC_TAGVDW0S1       *(volatile uint32_t *)0x4001F104    // Cache Tag Storage
#define FMC_TAGVDW1S0       *(volatile uint32_t *)0x4001F108    // Cache Tag Storage
#define FMC_TAGVDW1S1       *(volatile uint32_t *)0x4001F10C    // Cache Tag Storage
#define FMC_TAGVDW2S0       *(volatile uint32_t *)0x4001F110    // Cache Tag Storage
#define FMC_TAGVDW2S1       *(volatile uint32_t *)0x4001F114    // Cache Tag Storage
#define FMC_TAGVDW3S0       *(volatile uint32_t *)0x4001F118    // Cache Tag Storage
#define FMC_TAGVDW3S1       *(volatile uint32_t *)0x4001F11C    // Cache Tag Storage
#define FMC_DATAW0S0        *(volatile uint32_t *)0x4001F200    // Cache Data Storage
#define FMC_DATAW0S1        *(volatile uint32_t *)0x4001F204    // Cache Data Storage
#define FMC_DATAW1S0        *(volatile uint32_t *)0x4001F208    // Cache Data Storage
#define FMC_DATAW1S1        *(volatile uint32_t *)0x4001F20C    // Cache Data Storage
#define FMC_DATAW2S0        *(volatile uint32_t *)0x4001F210    // Cache Data Storage
#define FMC_DATAW2S1        *(volatile uint32_t *)0x4001F214    // Cache Data Storage
#define FMC_DATAW3S0        *(volatile uint32_t *)0x4001F218    // Cache Data Storage
#define FMC_DATAW3S1        *(volatile uint32_t *)0x4001F21C    // Cache Data Storage

// Chapter 28: Flash Memory Module (FTFL)
#define FTFL_FSTAT      *(volatile uint8_t  *)0x40020000      // Flash Status Register
#define FTFL_FSTAT_CCIF         (uint8_t)0x80           // Command Complete Interrupt Flag
#define FTFL_FSTAT_RDCOLERR     (uint8_t)0x40           // Flash Read Collision Error Flag
#define FTFL_FSTAT_ACCERR       (uint8_t)0x20           // Flash Access Error Flag
#define FTFL_FSTAT_FPVIOL       (uint8_t)0x10           // Flash Protection Violation Flag
#define FTFL_FSTAT_MGSTAT0      (uint8_t)0x01           // Memory Controller Command Completion Status Flag
#define FTFL_FCNFG      *(volatile uint8_t  *)0x40020001      // Flash Configuration Register
#define FTFL_FCNFG_CCIE         (uint8_t)0x80           // Command Complete Interrupt Enable
#define FTFL_FCNFG_RDCOLLIE     (uint8_t)0x40           // Read Collision Error Interrupt Enable
#define FTFL_FCNFG_ERSAREQ      (uint8_t)0x20           // Erase All Request
#define FTFL_FCNFG_ERSSUSP      (uint8_t)0x10           // Erase Suspend
#define FTFL_FCNFG_PFLSH        (uint8_t)0x04           // Flash memory configuration
#define FTFL_FCNFG_RAMRDY       (uint8_t)0x02           // RAM Ready
#define FTFL_FCNFG_EEERDY       (uint8_t)0x01           // EEPROM Ready
#define FTFL_FSEC               *(const    uint8_t  *)0x40020002      // Flash Security Register
#define FTFL_FOPT               *(const    uint8_t  *)0x40020003      // Flash Option Register
#define FTFL_FCCOB3             *(volatile uint8_t  *)0x40020004      // Flash Common Command Object Registers
#define FTFL_FCCOB2             *(volatile uint8_t  *)0x40020005
#define FTFL_FCCOB1             *(volatile uint8_t  *)0x40020006
#define FTFL_FCCOB0             *(volatile uint8_t  *)0x40020007
#define FTFL_FCCOB7             *(volatile uint8_t  *)0x40020008
#define FTFL_FCCOB6             *(volatile uint8_t  *)0x40020009
#define FTFL_FCCOB5             *(volatile uint8_t  *)0x4002000A
#define FTFL_FCCOB4             *(volatile uint8_t  *)0x4002000B
#define FTFL_FCCOBB             *(volatile uint8_t  *)0x4002000C
#define FTFL_FCCOBA             *(volatile uint8_t  *)0x4002000D
#define FTFL_FCCOB9             *(volatile uint8_t  *)0x4002000E
#define FTFL_FCCOB8             *(volatile uint8_t  *)0x4002000F
#define FTFL_FPROT3             *(volatile uint8_t  *)0x40020010      // Program Flash Protection Registers
#define FTFL_FPROT2             *(volatile uint8_t  *)0x40020011      // Program Flash Protection Registers
#define FTFL_FPROT1             *(volatile uint8_t  *)0x40020012      // Program Flash Protection Registers
#define FTFL_FPROT0             *(volatile uint8_t  *)0x40020013      // Program Flash Protection Registers
#define FTFL_FEPROT             *(volatile uint8_t  *)0x40020016      // EEPROM Protection Register
#define FTFL_FDPROT             *(volatile uint8_t  *)0x40020017      // Data Flash Protection Register

// Chapter 30: Cyclic Redundancy Check (CRC)
#define CRC_CRC                 *(volatile uint32_t *)0x40032000 // CRC Data register
#define CRC_GPOLY               *(volatile uint32_t *)0x40032004 // CRC Polynomial register
#define CRC_CTRL                *(volatile uint32_t *)0x40032008 // CRC Control register

// Chapter 31: Analog-to-Digital Converter (ADC)
#define ADC0_SC1A               *(volatile uint32_t *)0x4003B000 // ADC status and control registers 1
#define ADC0_SC1B               *(volatile uint32_t *)0x4003B004 // ADC status and control registers 1
#define ADC_SC1_COCO            (uint32_t)0x80          // Conversion complete flag
#define ADC_SC1_AIEN            (uint32_t)0x40          // Interrupt enable
#define ADC_SC1_DIFF            (uint32_t)0x20          // Differential mode enable
#define ADC_SC1_ADCH(n)         (uint32_t)((n) & 0x1F)      // Input channel select
#define ADC0_CFG1               *(volatile uint32_t *)0x4003B008 // ADC configuration register 1
#define ADC_CFG1_ADLPC          (uint32_t)0x80          // Low-power configuration
#define ADC_CFG1_ADIV(n)        (uint32_t)(((n) & 3) << 5)  // Clock divide select, 0=direct, 1=div2, 2=div4, 3=div8
#define ADC_CFG1_ADLSMP         (uint32_t)0x10          // Sample time configuration, 0=Short, 1=Long
#define ADC_CFG1_MODE(n)        (uint32_t)(((n) & 3) << 2)  // Conversion mode, 0=8 bit, 1=12 bit, 2=10 bit, 3=16 bit
#define ADC_CFG1_ADICLK(n)      (uint32_t)(((n) & 3) << 0)  // Input clock, 0=bus, 1=bus/2, 2=OSCERCLK, 3=async
#define ADC0_CFG2               *(volatile uint32_t *)0x4003B00C // Configuration register 2
#define ADC_CFG2_MUXSEL         (uint32_t)0x10          // 0=a channels, 1=b channels
#define ADC_CFG2_ADACKEN        (uint32_t)0x08          // async clock enable
#define ADC_CFG2_ADHSC          (uint32_t)0x04          // High speed configuration
#define ADC_CFG2_ADLSTS(n)      (uint32_t)(((n) & 3) << 0)  // Sample time, 0=24 cycles, 1=12 cycles, 2=6 cycles, 3=2 cycles
#define ADC0_RA                 *(volatile uint32_t *)0x4003B010 // ADC data result register
#define ADC0_RB                 *(volatile uint32_t *)0x4003B014 // ADC data result register
#define ADC0_CV1                *(volatile uint32_t *)0x4003B018 // Compare value registers
#define ADC0_CV2                *(volatile uint32_t *)0x4003B01C // Compare value registers
#define ADC0_SC2                *(volatile uint32_t *)0x4003B020 // Status and control register 2
#define ADC_SC2_ADACT           (uint32_t)0x80          // Conversion active
#define ADC_SC2_ADTRG           (uint32_t)0x40          // Conversion trigger select, 0=software, 1=hardware
#define ADC_SC2_ACFE            (uint32_t)0x20          // Compare function enable
#define ADC_SC2_ACFGT           (uint32_t)0x10          // Compare function greater than enable
#define ADC_SC2_ACREN           (uint32_t)0x08          // Compare function range enable
#define ADC_SC2_DMAEN           (uint32_t)0x04          // DMA enable
#define ADC_SC2_REFSEL(n)       (uint32_t)(((n) & 3) << 0)  // Voltage reference, 0=vcc/external, 1=1.2 volts
#define ADC0_SC3                *(volatile uint32_t *)0x4003B024 // Status and control register 3
#define ADC_SC3_CAL         (uint32_t)0x80          // Calibration, 1=begin, stays set while cal in progress
#define ADC_SC3_CALF            (uint32_t)0x40          // Calibration failed flag
#define ADC_SC3_ADCO            (uint32_t)0x08          // Continuous conversion enable
#define ADC_SC3_AVGE            (uint32_t)0x04          // Hardware average enable
#define ADC_SC3_AVGS(n)         (uint32_t)(((n) & 3) << 0)  // avg select, 0=4 samples, 1=8 samples, 2=16 samples, 3=32 samples
#define ADC0_OFS                *(volatile uint32_t *)0x4003B028 // ADC offset correction register
#define ADC0_PG                 *(volatile uint32_t *)0x4003B02C // ADC plus-side gain register
#define ADC0_MG                 *(volatile uint32_t *)0x4003B030 // ADC minus-side gain register
#define ADC0_CLPD               *(volatile uint32_t *)0x4003B034 // ADC plus-side general calibration value register
#define ADC0_CLPS               *(volatile uint32_t *)0x4003B038 // ADC plus-side general calibration value register
#define ADC0_CLP4               *(volatile uint32_t *)0x4003B03C // ADC plus-side general calibration value register
#define ADC0_CLP3               *(volatile uint32_t *)0x4003B040 // ADC plus-side general calibration value register
#define ADC0_CLP2               *(volatile uint32_t *)0x4003B044 // ADC plus-side general calibration value register
#define ADC0_CLP1               *(volatile uint32_t *)0x4003B048 // ADC plus-side general calibration value register
#define ADC0_CLP0               *(volatile uint32_t *)0x4003B04C // ADC plus-side general calibration value register
#define ADC0_CLMD               *(volatile uint32_t *)0x4003B054 // ADC minus-side general calibration value register
#define ADC0_CLMS               *(volatile uint32_t *)0x4003B058 // ADC minus-side general calibration value register
#define ADC0_CLM4               *(volatile uint32_t *)0x4003B05C // ADC minus-side general calibration value register
#define ADC0_CLM3               *(volatile uint32_t *)0x4003B060 // ADC minus-side general calibration value register
#define ADC0_CLM2               *(volatile uint32_t *)0x4003B064 // ADC minus-side general calibration value register
#define ADC0_CLM1               *(volatile uint32_t *)0x4003B068 // ADC minus-side general calibration value register
#define ADC0_CLM0               *(volatile uint32_t *)0x4003B06C // ADC minus-side general calibration value register
//#define MCG_C2_RANGE0(n)      (uint8_t)(((n) & 0x03) << 4)    // Frequency Range Select, Selects the frequency range for the crystal oscillator
//#define MCG_C2_LOCRE0         (uint8_t)0x80           // Loss of Clock Reset Enable, Determines whether an interrupt or a reset request is made following a loss of OSC0 

// Chapter 32: Comparator (CMP)
#define CMP0_CR0                *(volatile uint8_t  *)0x40073000 // CMP Control Register 0
#define CMP0_CR1                *(volatile uint8_t  *)0x40073001 // CMP Control Register 1
#define CMP0_FPR                *(volatile uint8_t  *)0x40073002 // CMP Filter Period Register
#define CMP0_SCR                *(volatile uint8_t  *)0x40073003 // CMP Status and Control Register
#define CMP0_DACCR              *(volatile uint8_t  *)0x40073004 // DAC Control Register
#define CMP0_MUXCR              *(volatile uint8_t  *)0x40073005 // MUX Control Register
#define CMP1_CR0                *(volatile uint8_t  *)0x40073008 // CMP Control Register 0
#define CMP1_CR1                *(volatile uint8_t  *)0x40073009 // CMP Control Register 1
#define CMP1_FPR                *(volatile uint8_t  *)0x4007300A // CMP Filter Period Register
#define CMP1_SCR                *(volatile uint8_t  *)0x4007300B // CMP Status and Control Register
#define CMP1_DACCR              *(volatile uint8_t  *)0x4007300C // DAC Control Register
#define CMP1_MUXCR              *(volatile uint8_t  *)0x4007300D // MUX Control Register

// Chapter 33: Voltage Reference (VREFV1)
#define VREF_TRM                *(volatile uint8_t  *)0x40074000 // VREF Trim Register
#define VREF_SC                 *(volatile uint8_t  *)0x40074001 // VREF Status and Control Register

