ftrias/vindormusic/firmware/dfu/bootloader/mk20dx128-old.h
// Chapter 41: USB Device Charger Detection Module (USBDCD)
#define USBDCD_CONTROL          *(volatile uint32_t *)0x40035000 // Control register
#define USBDCD_CLOCK            *(volatile uint32_t *)0x40035004 // Clock register
#define USBDCD_STATUS           *(volatile uint32_t *)0x40035008 // Status register
#define USBDCD_TIMER0           *(volatile uint32_t *)0x40035010 // TIMER0 register
#define USBDCD_TIMER1           *(volatile uint32_t *)0x40035014 // TIMER1 register
#define USBDCD_TIMER2           *(volatile uint32_t *)0x40035018 // TIMER2 register

// Chapter 43: SPI (DSPI)
#define SPI0_MCR                *(volatile uint32_t *)0x4002C000 // DSPI Module Configuration Register
#define SPI_MCR_MSTR            (uint32_t)0x80000000        // Master/Slave Mode Select
#define SPI_MCR_CONT_SCKE       (uint32_t)0x40000000        // 
#define SPI_MCR_DCONF(n)        (((n) & 3) << 28)       // 
#define SPI_MCR_FRZ         (uint32_t)0x08000000        // 
#define SPI_MCR_MTFE            (uint32_t)0x04000000        // 
#define SPI_MCR_ROOE            (uint32_t)0x01000000        // 
#define SPI_MCR_PCSIS(n)        (((n) & 0x1F) << 16)        //
#define SPI_MCR_DOZE            (uint32_t)0x00008000        // 
#define SPI_MCR_MDIS            (uint32_t)0x00004000        // 
#define SPI_MCR_DIS_TXF         (uint32_t)0x00002000        // 
#define SPI_MCR_DIS_RXF         (uint32_t)0x00001000        // 
#define SPI_MCR_CLR_TXF         (uint32_t)0x00000800        // 
#define SPI_MCR_CLR_RXF         (uint32_t)0x00000400        // 
#define SPI_MCR_SMPL_PT(n)      (((n) & 3) << 8)        //
#define SPI_MCR_HALT            (uint32_t)0x00000001        // 
#define SPI0_TCR                *(volatile uint32_t *)0x4002C008 // DSPI Transfer Count Register
#define SPI0_CTAR0              *(volatile uint32_t *)0x4002C00C // DSPI Clock and Transfer Attributes Register, In Master Mode
#define SPI_CTAR_DBR            (uint32_t)0x80000000        // Double Baud Rate
#define SPI_CTAR_FMSZ(n)        (((n) & 15) << 27)      // Frame Size (+1)
#define SPI_CTAR_CPOL           (uint32_t)0x04000000        // Clock Polarity
#define SPI_CTAR_CPHA           (uint32_t)0x02000000        // Clock Phase
#define SPI_CTAR_LSBFE          (uint32_t)0x01000000        // LSB First
#define SPI_CTAR_PCSSCK(n)      (((n) & 3) << 22)       // PCS to SCK Delay Prescaler
#define SPI_CTAR_PASC(n)        (((n) & 3) << 20)       // After SCK Delay Prescaler
#define SPI_CTAR_PDT(n)         (((n) & 3) << 18)       // Delay after Transfer Prescaler
#define SPI_CTAR_PBR(n)         (((n) & 3) << 16)       // Baud Rate Prescaler
#define SPI_CTAR_CSSCK(n)       (((n) & 15) << 12)      // PCS to SCK Delay Scaler
#define SPI_CTAR_ASC(n)         (((n) & 15) << 8)       // After SCK Delay Scaler
#define SPI_CTAR_DT(n)          (((n) & 15) << 4)       // Delay After Transfer Scaler
#define SPI_CTAR_BR(n)          (((n) & 15) << 0)       // Baud Rate Scaler
#define SPI0_CTAR0_SLAVE        *(volatile uint32_t *)0x4002C00C // DSPI Clock and Transfer Attributes Register, In Slave Mode
#define SPI0_CTAR1              *(volatile uint32_t *)0x4002C010 // DSPI Clock and Transfer Attributes Register, In Master Mode
#define SPI0_SR                 *(volatile uint32_t *)0x4002C02C // DSPI Status Register
#define SPI_SR_TCF          (uint32_t)0x80000000        // Transfer Complete Flag
#define SPI_SR_TXRXS            (uint32_t)0x40000000        // TX and RX Status
#define SPI_SR_EOQF         (uint32_t)0x10000000        // End of Queue Flag
#define SPI_SR_TFUF         (uint32_t)0x08000000        // Transmit FIFO Underflow Flag
#define SPI_SR_TFFF         (uint32_t)0x02000000        // Transmit FIFO Fill Flag
#define SPI_SR_RFOF         (uint32_t)0x00080000        // Receive FIFO Overflow Flag
#define SPI_SR_RFDF         (uint32_t)0x00020000        // Receive FIFO Drain Flag
#define SPI0_RSER               *(volatile uint32_t *)0x4002C030 // DSPI DMA/Interrupt Request Select and Enable Register
#define SPI0_PUSHR              *(volatile uint32_t *)0x4002C034 // DSPI PUSH TX FIFO Register In Master Mode
#define SPI_PUSHR_CONT          (uint32_t)0x80000000        // 
#define SPI_PUSHR_CTAS(n)       (((n) & 7) << 28)       // 
#define SPI_PUSHR_EOQ           (uint32_t)0x08000000        // 
#define SPI_PUSHR_CTCNT         (uint32_t)0x04000000        // 
#define SPI_PUSHR_PCS(n)        (((n) & 31) << 16)      //
#define SPI0_PUSHR_SLAVE        *(volatile uint32_t *)0x4002C034 // DSPI PUSH TX FIFO Register In Slave Mode
#define SPI0_POPR               *(volatile uint32_t *)0x4002C038 // DSPI POP RX FIFO Register
#define SPI0_TXFR0              *(volatile uint32_t *)0x4002C03C // DSPI Transmit FIFO Registers
#define SPI0_TXFR1              *(volatile uint32_t *)0x4002C040 // DSPI Transmit FIFO Registers
#define SPI0_TXFR2              *(volatile uint32_t *)0x4002C044 // DSPI Transmit FIFO Registers
#define SPI0_TXFR3              *(volatile uint32_t *)0x4002C048 // DSPI Transmit FIFO Registers
#define SPI0_RXFR0              *(volatile uint32_t *)0x4002C07C // DSPI Receive FIFO Registers
#define SPI0_RXFR1              *(volatile uint32_t *)0x4002C080 // DSPI Receive FIFO Registers
#define SPI0_RXFR2              *(volatile uint32_t *)0x4002C084 // DSPI Receive FIFO Registers
#define SPI0_RXFR3              *(volatile uint32_t *)0x4002C088 // DSPI Receive FIFO Registers

// Chapter 44: Inter-Integrated Circuit (I2C)
#define I2C0_A1                 *(volatile uint8_t  *)0x40066000 // I2C Address Register 1
#define I2C0_F                  *(volatile uint8_t  *)0x40066001 // I2C Frequency Divider register
#define I2C0_C1                 *(volatile uint8_t  *)0x40066002 // I2C Control Register 1
#define I2C_C1_IICEN            (uint8_t)0x80           // I2C Enable
#define I2C_C1_IICIE            (uint8_t)0x40           // I2C Interrupt Enable
#define I2C_C1_MST          (uint8_t)0x20           // Master Mode Select
#define I2C_C1_TX           (uint8_t)0x10           // Transmit Mode Select
#define I2C_C1_TXAK         (uint8_t)0x08           // Transmit Acknowledge Enable
#define I2C_C1_RSTA         (uint8_t)0x04           // Repeat START
#define I2C_C1_WUEN         (uint8_t)0x02           // Wakeup Enable
#define I2C_C1_DMAEN            (uint8_t)0x01           // DMA Enable
#define I2C0_S                  *(volatile uint8_t  *)0x40066003 // I2C Status register
#define I2C_S_TCF           (uint8_t)0x80           // Transfer Complete Flag
#define I2C_S_IAAS          (uint8_t)0x40           // Addressed As A Slave
#define I2C_S_BUSY          (uint8_t)0x20           // Bus Busy
#define I2C_S_ARBL          (uint8_t)0x10           // Arbitration Lost
#define I2C_S_RAM           (uint8_t)0x08           // Range Address Match
#define I2C_S_SRW           (uint8_t)0x04           // Slave Read/Write
#define I2C_S_IICIF         (uint8_t)0x02           // Interrupt Flag
#define I2C_S_RXAK          (uint8_t)0x01           // Receive Acknowledge
#define I2C0_D                  *(volatile uint8_t  *)0x40066004 // I2C Data I/O register
#define I2C0_C2                 *(volatile uint8_t  *)0x40066005 // I2C Control Register 2
#define I2C_C2_GCAEN            (uint8_t)0x80           // General Call Address Enable
#define I2C_C2_ADEXT            (uint8_t)0x40           // Address Extension
#define I2C_C2_HDRS         (uint8_t)0x20           // High Drive Select
#define I2C_C2_SBRC         (uint8_t)0x10           // Slave Baud Rate Control
#define I2C_C2_RMEN         (uint8_t)0x08           // Range Address Matching Enable
#define I2C_C2_AD(n)            ((n) & 7)           // Slave Address, upper 3 bits
#define I2C0_FLT                *(volatile uint8_t  *)0x40066006 // I2C Programmable Input Glitch Filter register
#define I2C0_RA                 *(volatile uint8_t  *)0x40066007 // I2C Range Address register
#define I2C0_SMB                *(volatile uint8_t  *)0x40066008 // I2C SMBus Control and Status register
#define I2C0_A2                 *(volatile uint8_t  *)0x40066009 // I2C Address Register 2
#define I2C0_SLTH               *(volatile uint8_t  *)0x4006600A // I2C SCL Low Timeout Register High
#define I2C0_SLTL               *(volatile uint8_t  *)0x4006600B // I2C SCL Low Timeout Register Low

