ftrias/vindormusic/firmware/dfu/bootloader/mk20dx128-old.h
// Chapter 48: Touch sense input (TSI)
#define TSI0_GENCS              *(volatile uint32_t *)0x40045000 // General Control and Status Register
#define TSI_GENCS_LPCLKS        (uint32_t)0x10000000        // 
#define TSI_GENCS_LPSCNITV(n)       (((n) & 15) << 24)      // 
#define TSI_GENCS_NSCN(n)       (((n) & 31) << 19)      // 
#define TSI_GENCS_PS(n)         (((n) & 7) << 16)       // 
#define TSI_GENCS_EOSF          (uint32_t)0x00008000        // 
#define TSI_GENCS_OUTRGF        (uint32_t)0x00004000        // 
#define TSI_GENCS_EXTERF        (uint32_t)0x00002000        // 
#define TSI_GENCS_OVRF          (uint32_t)0x00001000        // 
#define TSI_GENCS_SCNIP         (uint32_t)0x00000200        // 
#define TSI_GENCS_SWTS          (uint32_t)0x00000100        // 
#define TSI_GENCS_TSIEN         (uint32_t)0x00000080        // 
#define TSI_GENCS_TSIIE         (uint32_t)0x00000040        // 
#define TSI_GENCS_ERIE          (uint32_t)0x00000020        // 
#define TSI_GENCS_ESOR          (uint32_t)0x00000010        // 
#define TSI_GENCS_STM           (uint32_t)0x00000002        // 
#define TSI_GENCS_STPE          (uint32_t)0x00000001        // 
#define TSI0_SCANC              *(volatile uint32_t *)0x40045004 // SCAN Control Register
#define TSI_SCANC_REFCHRG(n)        (((n) & 15) << 24)      // 
#define TSI_SCANC_EXTCHRG(n)        (((n) & 7) << 16)       // 
#define TSI_SCANC_SMOD(n)       (((n) & 255) << 8)      // 
#define TSI_SCANC_AMCLKS(n)     (((n) & 3) << 3)        // 
#define TSI_SCANC_AMPSC(n)      (((n) & 7) << 0)        // 
#define TSI0_PEN                *(volatile uint32_t *)0x40045008 // Pin Enable Register
#define TSI0_WUCNTR             *(volatile uint32_t *)0x4004500C // Wake-Up Channel Counter Register
#define TSI0_CNTR1              *(volatile uint32_t *)0x40045100 // Counter Register
#define TSI0_CNTR3              *(volatile uint32_t *)0x40045104 // Counter Register
#define TSI0_CNTR5              *(volatile uint32_t *)0x40045108 // Counter Register
#define TSI0_CNTR7              *(volatile uint32_t *)0x4004510C // Counter Register
#define TSI0_CNTR9              *(volatile uint32_t *)0x40045110 // Counter Register
#define TSI0_CNTR11             *(volatile uint32_t *)0x40045114 // Counter Register
#define TSI0_CNTR13             *(volatile uint32_t *)0x40045118 // Counter Register
#define TSI0_CNTR15             *(volatile uint32_t *)0x4004511C // Counter Register
#define TSI0_THRESHOLD          *(volatile uint32_t *)0x40045120 // Low Power Channel Threshold Register

// Nested Vectored Interrupt Controller, Table 3-4 & ARMv7 ref, appendix B3.4 (page 750)
#define NVIC_ENABLE_IRQ(n)  (*((volatile uint32_t *)0xE000E100 + (n >> 5)) = (1 << (n & 31)))
#define NVIC_DISABLE_IRQ(n) (*((volatile uint32_t *)0xE000E180 + (n >> 5)) = (1 << (n & 31)))
#define NVIC_SET_PENDING(n) (*((volatile uint32_t *)0xE000E200 + (n >> 5)) = (1 << (n & 31)))
#define NVIC_CLEAR_PENDING(n)   (*((volatile uint32_t *)0xE000E280 + (n >> 5)) = (1 << (n & 31)))

#define NVIC_ISER0      *(volatile uint32_t *)0xE000E100
#define NVIC_ISER1      *(volatile uint32_t *)0xE000E104
#define NVIC_ICER0      *(volatile uint32_t *)0xE000E180
#define NVIC_ICER1      *(volatile uint32_t *)0xE000E184

//#define NVIC_SET_PRIORITY(n, p)   
#define IRQ_DMA_CH0     0
#define IRQ_DMA_CH1     1
#define IRQ_DMA_CH2     2
#define IRQ_DMA_CH3     3
#define IRQ_DMA_ERROR       4
#define IRQ_FTFL_COMPLETE   6
#define IRQ_FTFL_COLLISION  7
#define IRQ_LOW_VOLTAGE     8
#define IRQ_LLWU        9
#define IRQ_WDOG        10
#define IRQ_I2C0        11
#define IRQ_SPI0        12
#define IRQ_I2S0_TX     13
#define IRQ_I2S0_RX     14
#define IRQ_UART0_LON       15
#define IRQ_UART0_STATUS    16
#define IRQ_UART0_ERROR     17
#define IRQ_UART1_STATUS    18
#define IRQ_UART1_ERROR     19
#define IRQ_UART2_STATUS    20
#define IRQ_UART2_ERROR     21
#define IRQ_ADC0        22
#define IRQ_CMP0        23
#define IRQ_CMP1        24
#define IRQ_FTM0        25
#define IRQ_FTM1        26
#define IRQ_CMT         27
#define IRQ_RTC_ALARM       28
#define IRQ_RTC_SECOND      29
#define IRQ_PIT_CH0     30
#define IRQ_PIT_CH1     31
#define IRQ_PIT_CH2     32
#define IRQ_PIT_CH3     33
#define IRQ_PDB         34
#define IRQ_USBOTG      35
#define IRQ_USBDCD      36
#define IRQ_TSI         37
#define IRQ_MCG         38
#define IRQ_LPTMR       39
#define IRQ_PORTA       40
#define IRQ_PORTB       41
#define IRQ_PORTC       42
#define IRQ_PORTD       43
#define IRQ_PORTE       44
#define IRQ_SOFTWARE        45


#define __disable_irq() asm volatile("CPSID i");
#define __enable_irq()  asm volatile("CPSIE i");

// System Control Space (SCS), ARMv7 ref manual, B3.2, page 708
#define SCB_CPUID       *(const    uint32_t *)0xE000ED00 // CPUID Base Register
#define SCB_ICSR        *(volatile uint32_t *)0xE000ED04 // Interrupt Control and State
#define SCB_ICSR_PENDSTSET      (uint32_t)0x04000000
#define SCB_VTOR        *(volatile uint32_t *)0xE000ED08 // Vector Table Offset
#define SCB_AIRCR       *(volatile uint32_t *)0xE000ED0C // Application Interrupt and Reset Control
#define SCB_SCR         *(volatile uint32_t *)0xE000ED10 // System Control Register
#define SCB_CCR         *(volatile uint32_t *)0xE000ED14 // Configuration and Control
#define SCB_SHPR1       *(volatile uint32_t *)0xE000ED18 // System Handler Priority Register 1
#define SCB_SHPR2       *(volatile uint32_t *)0xE000ED1C // System Handler Priority Register 2
#define SCB_SHPR3       *(volatile uint32_t *)0xE000ED20 // System Handler Priority Register 3
#define SCB_SHCSR       *(volatile uint32_t *)0xE000ED24 // System Handler Control and State
#define SCB_CFSR        *(volatile uint32_t *)0xE000ED28 // Configurable Fault Status Register
#define SCB_HFSR        *(volatile uint32_t *)0xE000ED2C // HardFault Status
#define SCB_DFSR        *(volatile uint32_t *)0xE000ED30 // Debug Fault Status
#define SCB_MMFAR       *(volatile uint32_t *)0xE000ED34 // MemManage Fault Address

#define SYST_CSR        *(volatile uint32_t *)0xE000E010 // SysTick Control and Status
#define SYST_CSR_COUNTFLAG      (uint32_t)0x00010000
#define SYST_CSR_CLKSOURCE      (uint32_t)0x00000004
#define SYST_CSR_TICKINT        (uint32_t)0x00000002
#define SYST_CSR_ENABLE         (uint32_t)0x00000001
#define SYST_RVR        *(volatile uint32_t *)0xE000E014 // SysTick Reload Value Register
#define SYST_CVR        *(volatile uint32_t *)0xE000E018 // SysTick Current Value Register
#define SYST_CALIB      *(const    uint32_t *)0xE000E01C // SysTick Calibration Value


#define ARM_DEMCR               *(volatile uint32_t *)0xE000EDFC // Debug Exception and Monitor Control
#define ARM_DEMCR_TRCENA        (1 << 24)        // Enable debugging & monitoring blocks
#define ARM_DWT_CTRL            *(volatile uint32_t *)0xE0001000 // DWT control register
#define ARM_DWT_CTRL_CYCCNTENA          (1 << 0)                // Enable cycle count
#define ARM_DWT_CYCCNT          *(volatile uint32_t *)0xE0001004 // Cycle count register


